{
  "backend/main.mo": "Motoko actor defining AC service booking system with CRUD operations for bookings (create, read, update status, delete) stored in a Map, supporting four service types and four booking statuses.",
  "feature_evidence.json": "Feature evidence report documenting the implementation of a contact information section in the Layout header displaying a business phone number prominently across all pages.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of frontend files describing the React app structure with booking form, list, layout with contact phone, custom hooks, and teal/blue themed styling.",
  "frontend/index.css": "Tailwind CSS configuration with OKLCH color system defining comprehensive design tokens for light and dark modes including primary, secondary, muted, accent, destructive, and sidebar colors.",
  "frontend/index.html": "HTML entry point for the AC Service Booking App with root div and module script reference to main.tsx.",
  "frontend/src/App.tsx": "Root React component wrapping BookingForm and BookingList in Layout with ThemeProvider and Toaster for notifications.",
  "frontend/src/components/BookingForm.tsx": "Comprehensive booking form component with fields for customer name, contact, service type, date, time, and address using shadcn UI components with icons and form validation.",
  "frontend/src/components/BookingList.tsx": "Table component displaying all bookings with inline status updates via dropdown, delete confirmation dialog, loading skeletons, and empty state handling.",
  "frontend/src/components/Layout.tsx": "Layout component with sticky header containing AC Service Pro branding and prominent contact phone button (+91 98765 43210), main content area, and footer with attribution.",
  "frontend/src/hooks/useActor.ts": "Custom hook managing Internet Identity authentication and creating backend actor instances with automatic query invalidation when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication on ICP, managing login state, identity persistence, and AuthClient lifecycle with configurable options.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for booking operations (getAllBookings, createBooking, updateBookingStatus, deleteBooking) with toast notifications and automatic cache invalidation.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom design tokens for a professional teal/blue color palette suitable for an AC service application, including light and dark mode variants.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client and Internet Identity provider, then renders the root App component.",
  "frontend/tailwind.config.js": "Tailwind configuration extending the theme with custom colors using OKLCH color space, border radius variables, custom shadows, Inter font family, and accordion animations.",
  "project_state.json": "Project metadata tracking an AC service booking app with completed features for booking forms, booking list views, professional UI theme, and contact information display, plus pending backend implementation requests."
}